{"case_id":"0101","difficulty":"high","expected_behavior":{"suicidal_ideation":"indeterminate","intent":"absent","plan":"absent","temporal":"recent"},"notes":["high distress ≠ suicidality","explicit denial of suicidal ideation must be respected"],"text":"Outpatient psychiatric assessment attached to a psychiatric hospital with emergency medical services. Patient evaluated by a Psychiatry Resident Physician.\n\nM.F.A., 58 years old, female, homemaker.\n\nChief complaint and duration: \"I have had depression for years, but it got worse after my husband died.\"\n\nPatient presents to outpatient psychiatric care accompanied by her son, tearful, sobbing.\n\nReports prior treatment for a mood disorder for approximately 20 years, currently on desvenlafaxine 50 mg. She reports that the initial depressive episode began after the loss of the family dog, Nelson.\n\nReports significant worsening of symptoms three months ago following the death of her husband due to stroke (per patient report).\n\n\"I cry day and night,\" she states.\n\nAssociated symptoms include early insomnia and non-restorative sleep. Denies somatic complaints.\n\nDuring the mental status examination, patient displays marked emotional distress with intense crying, interspersed with brief moments of emotional reorganization.\n\nNeutral, dark clothing. Appropriate behavior. Good rapport with accompanying family member.\n\nShe also reports intrusive thoughts related to grief and longing, stating: \"I want to die without him,\" verbatim.\n\nHer son expressed concern and requested hospitalization. The patient agrees to inpatient care; however, she explicitly denies suicidal ideation.\n\nSpeech is coherent, with tragic content, normal flow, mood-congruent, and without perceptual disturbances.\n\nDenies suicidal ideation.\n\nFamily history: Mother deceased 15 years ago. Father alive with Alzheimer’s disease. Married, mother of two biological children. Lives with husband, two children, and father. Grandfather with history of alcohol use disorder.\n\nPersonal medical history: Type 1 diabetes mellitus on metformin (dose unknown). Desvenlafaxine 50 mg once daily. Two cesarean sections. Breast implants. Denies medication allergies.\n\nDiagnosis: Major Depressive Episode, severe, without psychotic features.\n\nPlan: Request laboratory workup and inpatient psychiatric admission under my care."}
{"case_id":"0102","difficulty":"low","expected_behavior":{"suicidal_ideation":"present","intent":"present","plan":"present","past_behavior":"present","temporal":"current"},"notes":["unequivocal suicide attempt","no ambiguity"],"text":"Emergency department case report. Patient evaluated by an emergency physician.\n\nM.S.R.C., male, 30 years old, single, electrical technician.\n\nChief complaint: SUICIDE ATTEMPT – EXOGENOUS INTOXICATION.\n\nPatient arrived by wheelchair, brought by family members in an emergency situation.\n\nMother reports that the patient is a user of multiple substances (alcohol, crack cocaine, marijuana) and had been followed at a public outpatient service for six months, with five months of reported abstinence.\n\n\"He had really stopped, doctor,\" she states.\n\nShe reports that the patient had been isolated in his room for over one day and, during lunch, expressed: \"I cause too much trouble.\" \"I'm a burden to everyone.\"\n\nMother reports finding the patient hyporesponsive, lying in bed, pale, cold, diaphoretic, with white-greenish frothy secretion around the lips and oropharynx.\n\nAccording to the accompanying family member, the patient was taking: Naltrexone (dose unknown), Valproic acid 1 g every 12 hours, Diazepam 5 mg every 8 hours, Risperidone 1 mg every 8 hours, Chlorpromazine 25 mg at bedtime.\n\nAt triage: Heart rate 60 bpm, blood pressure 70/20 mmHg, Glasgow Coma Scale 6, oxygen saturation 71%, temperature 36°C.\n\nDiagnosis: Exogenous intoxication.\n\nConduct: Endotracheal intubation.\n\nOutcome: Patient progressed to shock, cardiac arrest, and death."}
{"case_id":"0103","difficulty":"medium","expected_behavior":{"suicidal_ideation":"present","intent":"present","plan":"present","past_behavior":"present","temporal":"past"},"notes":["evidence derived from third-party reports","post-mortem reconstruction"],"text":"Emergency medical service (ambulance) report – SAMU, Londrina. Patient was not evaluated by a physician prior to death.\n\nJ.L.F.C.\n\nAmbulance occurrence #2211. Location redacted. Monday, December 25, 2024.\n\nA bystander contacted emergency services in the morning reporting that they had heard a gunshot. The caller was instructed to contact Military Police.\n\nPolice units responded and subsequently reactivated emergency medical services, initially requesting ambulance support due to a possible firearm injury to the left temporal region.\n\nAn advanced life support unit (mobile ICU) was dispatched at 23:33 to the location, where J.L.F.C. was found without vital signs. Death was confirmed, and referral to the Medical Examiner’s Office was requested.\n\nA statement was obtained from the patient’s father, who reported that the patient had been experiencing problems with depression, had posted farewell messages on social media, and had left a letter.\n\nDeath was confirmed, and the body was referred to the Medical Examiner’s Office.\n\nCause of death: Cardiorespiratory arrest / Traumatic brain injury / Depression – firearm injury. Final cause pending official autopsy report."}
